Repository: hjunior29/algorithms
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: pt

source: 3-way partitioning variant, excellent for arrays with many duplicates.
pt: Variante de particionamento em 3 vias, excelente para arrays com muitas duplicatas.

source: Actions
pt: Ações

source: Adjust speed, array size, and values in real-time to explore different scenarios.
pt: Ajuste velocidade, tamanho do array e valores em tempo real para explorar diferentes cenários.

source: Algorithm
pt: Algoritmo

source: Attempting to reconnect
pt: Tentando reconectar

source: Builds the sorted array one element at a time. Efficient for small or nearly sorted data.
pt: Constrói o array ordenado um elemento por vez. Eficiente para dados pequenos ou quase ordenados.

source: Built with Phoenix LiveView by
pt: Feito com Phoenix LiveView por

source: Click "Generate" to begin
pt: Clique em "Gerar" para começar

source: Compare Performance
pt: Compare Desempenho

source: Count
pt: Qtd

source: Delay
pt: Atraso

source: Delay (ms)
pt: Atraso (ms)

source: Divide and conquer algorithm that splits, sorts, and merges arrays.
pt: Algoritmo dividir e conquistar que divide, ordena e mescla arrays.

source: Done
pt: Concluído

source: Explore 8 classic sorting algorithms, from simple to advanced. Each one has its own strengths and ideal use cases.
pt: Explore 8 algoritmos clássicos de ordenação, do simples ao avançado. Cada um tem seus pontos fortes e casos de uso ideais.

source: Fast divide and conquer using a pivot element to partition arrays.
pt: Dividir e conquistar rápido usando um elemento pivô para particionar arrays.

source: Featured Algorithms
pt: Algoritmos em Destaque

source: Generalization of insertion sort that allows exchange of far apart elements.
pt: Generalização do insertion sort que permite troca de elementos distantes.

source: Generate
pt: Gerar

source: History
pt: História

source: Interactive Controls
pt: Controles Interativos

source: Learn Visually
pt: Aprenda Visualmente

source: Max
pt: Máx

source: Max Value
pt: Valor Máximo

source: Operations
pt: Operações

source: Quantity
pt: Quantidade

source: Ready
pt: Pronto

source: Ready to Explore?
pt: Pronto para Explorar?

source: Repeatedly finds the minimum element and moves it to the sorted portion.
pt: Encontra repetidamente o elemento mínimo e o move para a parte ordenada.

source: Repeatedly swaps adjacent elements if they are in the wrong order.
pt: Troca repetidamente elementos adjacentes se estiverem na ordem errada.

source: Reset
pt: Reiniciar

source: Results
pt: Resultados

source: Run
pt: Executar

source: Running
pt: Executando

source: See exactly how each algorithm processes data, making complex logic easy to understand.
pt: Veja exatamente como cada algoritmo processa dados, tornando lógica complexa fácil de entender.

source: Something went wrong!
pt: Algo deu errado!

source: Start
pt: Iniciar

source: Start visualizing sorting algorithms now. Generate random data, pick an algorithm, and watch the magic happen.
pt: Comece a visualizar algoritmos de ordenação agora. Gere dados aleatórios, escolha um algoritmo e veja a mágica acontecer.

source: Time
pt: Tempo

source: Track operations and execution time to understand the efficiency of different approaches.
pt: Acompanhe operações e tempo de execução para entender a eficiência de diferentes abordagens.

source: Understanding sorting algorithms is fundamental to computer science. Watching them work visually transforms abstract concepts into intuitive knowledge.
pt: Entender algoritmos de ordenação é fundamental para ciência da computação. Vê-los funcionando visualmente transforma conceitos abstratos em conhecimento intuitivo.

source: Uses a binary heap data structure to sort elements efficiently.
pt: Usa uma estrutura de dados heap binário para ordenar elementos eficientemente.

source: Waiting
pt: Aguardando

source: Watch sorting algorithms come to life. Understand how different algorithms work by seeing them in action, step by step.
pt: Veja algoritmos de ordenação ganharem vida. Entenda como diferentes algoritmos funcionam vendo-os em ação, passo a passo.

source: We can't find the internet
pt: Não conseguimos encontrar a internet

source: Why Algorithm Visualization?
pt: Por que Visualizar Algoritmos?

source: close
pt: fechar

source: (3-way Quick Sort) is a variation developed by Dijkstra for handling arrays with many duplicate keys.
pt: (Quick Sort de 3 vias) é uma variação desenvolvida por Dijkstra para lidar com arrays com muitas chaves duplicadas.

source: 3-way partitioning for duplicates.
pt: Particionamento em 3 vias para duplicatas.

source: Adapts well to existing order
pt: Adapta-se bem à ordem existente

source: Always O(n log n)
pt: Sempre O(n log n)

source: Approaches O(n) performance
pt: Aproxima-se de desempenho O(n)

source: As a subroutine
pt: Como sub-rotina

source: As good as Quick Sort, better with duplicates
pt: Tão bom quanto Quick Sort, melhor com duplicatas

source: Average
pt: Média

source: Average Case
pt: Caso Médio

source: Back to all algorithms
pt: Voltar para todos os algoritmos

source: Best Case
pt: Melhor Caso

source: Build a max-heap from the input array
pt: Construir um max-heap a partir do array de entrada

source: Builds sorted array one element at a time.
pt: Constrói array ordenado um elemento por vez.

source: Can sort data as it arrives
pt: Pode ordenar dados conforme chegam

source: Checking if sorted
pt: Verificar se está ordenado

source: Choose a pivot element
pt: Escolher um elemento pivô

source: Common prefixes are handled efficiently
pt: Prefixos comuns são tratados eficientemente

source: Compact implementation
pt: Implementação compacta

source: Compare adjacent elements from the beginning
pt: Comparar elementos adjacentes desde o início

source: Compare elements that are 'gap' positions apart
pt: Comparar elementos que estão 'gap' posições distantes

source: Compare it with elements before it
pt: Comparar com elementos anteriores

source: Complexity
pt: Complexidade

source: Continue to the end of the array
pt: Continuar até o final do array

source: Copy remaining elements from either half
pt: Copiar elementos restantes de qualquer metade

source: Despite being inefficient for most real-world applications, it's valuable for educational purposes and can be optimized with an early termination flag.
pt: Apesar de ser ineficiente para a maioria das aplicações reais, é valioso para fins educacionais e pode ser otimizado com um flag de terminação antecipada.

source: Despite its O(n²) average complexity, it remains widely used due to its simplicity, low overhead, and excellent performance on small or nearly sorted datasets.
pt: Apesar de sua complexidade média O(n²), continua amplamente utilizado devido à sua simplicidade, baixo overhead e excelente desempenho em conjuntos de dados pequenos ou quase ordenados.

source: Despite its O(n²) worst case, careful pivot selection (like median-of-three) makes this scenario extremely rare in practice.
pt: Apesar do pior caso O(n²), a seleção cuidadosa do pivô (como mediana de três) torna este cenário extremamente raro na prática.

source: Detecting sorted arrays
pt: Detectar arrays ordenados

source: Divide and conquer with merging.
pt: Dividir e conquistar com mesclagem.

source: Divide the array into two halves
pt: Dividir o array em duas metades

source: Easy to understand and implement
pt: Fácil de entender e implementar

source: Easy to verify correctness
pt: Fácil de verificar corretude

source: Educational purposes
pt: Fins educacionais

source: Elements equal to pivot are already in place
pt: Elementos iguais ao pivô já estão no lugar

source: Embedded systems
pt: Sistemas embarcados

source: Excellent cache performance
pt: Excelente desempenho de cache

source: External sorting
pt: Ordenação externa

source: Fastest on average
pt: Mais rápido em média

source: Find the minimum element in the unsorted portion
pt: Encontrar o elemento mínimo na parte não ordenada

source: Finding k largest/smallest
pt: Encontrar k maiores/menores

source: Finds minimum and moves to sorted portion.
pt: Encontra o mínimo e move para a parte ordenada.

source: General-purpose
pt: Uso geral

source: General-purpose sorting
pt: Ordenação de uso geral

source: Good balance of simplicity and speed
pt: Bom equilíbrio entre simplicidade e velocidade

source: Guaranteed O(n log n)
pt: O(n log n) garantido

source: Guaranteed performance
pt: Desempenho garantido

source: Heapify the root to restore heap property
pt: Heapify na raiz para restaurar propriedade do heap

source: Home
pt: Início

source: How it works
pt: Como funciona

source: Insert the element at the correct position
pt: Inserir o elemento na posição correta

source: Insertion sort with diminishing gaps.
pt: Insertion sort com gaps decrescentes.

source: Instead of two partitions, it creates three: elements less than, equal to, and greater than the pivot.
pt: Em vez de duas partições, cria três: elementos menores que, iguais a e maiores que o pivô.

source: Large datasets
pt: Grandes conjuntos de dados

source: Learn
pt: Aprender

source: Learn Sorting Algorithms
pt: Aprenda Algoritmos de Ordenação

source: Like flash memory
pt: Como memória flash

source: Like sorting grades or categories
pt: Como ordenar notas ou categorias

source: Limited key range
pt: Faixa de chaves limitada

source: Linear time for all equal elements
pt: Tempo linear para todos elementos iguais

source: Linked lists
pt: Listas encadeadas

source: Low memory overhead, no recursion
pt: Baixo uso de memória, sem recursão

source: Many duplicate keys
pt: Muitas chaves duplicadas

source: Many practical applications
pt: Muitas aplicações práticas

source: Medium-sized arrays
pt: Arrays de tamanho médio

source: Memory constrained
pt: Memória limitada

source: Memory writes are expensive
pt: Escritas em memória são caras

source: Merge Sort is stable and predictable, making it ideal for sorting linked lists and external sorting (sorting data that doesn't fit in memory).
pt: Merge Sort é estável e previsível, tornando-o ideal para ordenar listas encadeadas e ordenação externa (ordenar dados que não cabem na memória).

source: Merge the sorted halves by comparing elements
pt: Mesclar as metades ordenadas comparando elementos

source: Minimal swaps needed
pt: Mínimo de trocas necessárias

source: Move the boundary of sorted portion one element ahead
pt: Mover o limite da parte ordenada um elemento à frente

source: Natural fit for heap operations
pt: Encaixe natural para operações de heap

source: Naturally parallelizable
pt: Naturalmente paralelizável

source: Nearly sorted data
pt: Dados quase ordenados

source: No
pt: Não

source: No random access needed, O(1) extra space
pt: Não precisa de acesso aleatório, espaço extra O(1)

source: No worst case degradation
pt: Sem degradação no pior caso

source: Online sorting
pt: Ordenação online

source: Only O(1) extra space
pt: Apenas O(1) de espaço extra

source: Only O(n) swaps are made
pt: Apenas O(n) trocas são feitas

source: Other algorithms
pt: Outros algoritmos

source: Overhead is minimal for n < 50
pt: Overhead é mínimo para n < 50

source: Parallel processing
pt: Processamento paralelo

source: Partial sorting is efficient
pt: Ordenação parcial é eficiente

source: Partially sorted data
pt: Dados parcialmente ordenados

source: Partition around pivot element.
pt: Particiona em torno do elemento pivô.

source: Partition into three: less than, equal to, greater than pivot
pt: Particionar em três: menor que, igual a, maior que pivô

source: Partition: place smaller elements left, larger right
pt: Particionar: colocar menores à esquerda, maiores à direita

source: Preserves order of equal elements
pt: Preserva ordem de elementos iguais

source: Priority queues
pt: Filas de prioridade

source: Recursively sort each half
pt: Ordenar recursivamente cada metade

source: Recursively sort the 'greater than' partition
pt: Ordenar recursivamente a partição 'maior que'

source: Recursively sort the 'less than' partition
pt: Ordenar recursivamente a partição 'menor que'

source: Recursively sort the left partition
pt: Ordenar recursivamente a partição esquerda

source: Recursively sort the right partition
pt: Ordenar recursivamente a partição direita

source: Reduce heap size by one
pt: Reduzir tamanho do heap em um

source: Reduce the gap (typically by half)
pt: Reduzir o gap (tipicamente pela metade)

source: Repeat for all remaining elements
pt: Repetir para todos os elementos restantes

source: Repeat passes until no swaps are needed
pt: Repetir passagens até que nenhuma troca seja necessária

source: Repeat until gap becomes 1 (final insertion sort)
pt: Repetir até que gap se torne 1 (insertion sort final)

source: Repeat until heap size is 1
pt: Repetir até que o tamanho do heap seja 1

source: Repeat until the entire array is sorted
pt: Repetir até que todo o array esteja ordenado

source: Scales well with size
pt: Escala bem com o tamanho

source: See this algorithm in action with the visualizer.
pt: Veja este algoritmo em ação com o visualizador.

source: Shift larger elements one position ahead
pt: Mover elementos maiores uma posição à frente

source: Simple implementation
pt: Implementação simples

source: Small datasets
pt: Conjuntos de dados pequenos

source: Sorting data larger than memory
pt: Ordenar dados maiores que a memória

source: Space
pt: Espaço

source: Stable
pt: Estável

source: Stable sort required
pt: Ordenação estável necessária

source: Start from the second element (index 1)
pt: Começar do segundo elemento (índice 1)

source: Start with a large gap (typically n/2)
pt: Começar com um gap grande (tipicamente n/2)

source: String sorting
pt: Ordenação de strings

source: Swap if they are in the wrong order
pt: Trocar se estiverem na ordem errada

source: Swap it with the first unsorted element
pt: Trocar com o primeiro elemento não ordenado

source: Swap the root (maximum) with the last element
pt: Trocar a raiz (máximo) com o último elemento

source: Swap them if they are in the wrong order
pt: Trocar se estiverem na ordem errada

source: Swaps adjacent elements repeatedly.
pt: Troca elementos adjacentes repetidamente.

source: The algorithm first builds a max-heap from the input, then repeatedly extracts the maximum element and rebuilds the heap.
pt: O algoritmo primeiro constrói um max-heap da entrada, depois extrai repetidamente o elemento máximo e reconstrói o heap.

source: The algorithm is a generalization of insertion sort that allows the exchange of items that are far apart, progressively reducing the gap between elements to compare.
pt: O algoritmo é uma generalização do insertion sort que permite a troca de itens distantes, reduzindo progressivamente a distância entre elementos a comparar.

source: The algorithm uses the divide-and-conquer paradigm: it divides the array in half, recursively sorts each half, then merges the sorted halves.
pt: O algoritmo usa o paradigma dividir e conquistar: divide o array ao meio, ordena recursivamente cada metade, depois mescla as metades ordenadas.

source: The algorithm was first described by John Mauchly in 1946, making it one of the earliest sorting algorithms to be formally analyzed.
pt: O algoritmo foi descrito pela primeira vez por John Mauchly em 1946, tornando-o um dos primeiros algoritmos de ordenação a ser formalmente analisado.

source: The algorithm was one of the first sorting methods to be formally studied in computer science, appearing in early computing literature in the 1950s.
pt: O algoritmo foi um dos primeiros métodos de ordenação a ser formalmente estudado em ciência da computação, aparecendo na literatura de computação nos anos 1950.

source: The algorithm works by selecting a 'pivot' element and partitioning the array around it, placing smaller elements before and larger elements after.
pt: O algoritmo funciona selecionando um elemento 'pivô' e particionando o array ao redor dele, colocando elementos menores antes e maiores depois.

source: The efficiency depends heavily on the gap sequence used. Shell's original sequence gives O(n²), but better sequences can achieve O(n log² n) or better.
pt: A eficiência depende muito da sequência de gaps usada. A sequência original de Shell dá O(n²), mas sequências melhores podem alcançar O(n log² n) ou melhor.

source: The name comes from the way smaller elements 'bubble' to the top of the list. It was analyzed as early as 1956 by mathematician Edward Friend.
pt: O nome vem da forma como elementos menores 'borbulham' para o topo da lista. Foi analisado já em 1956 pelo matemático Edward Friend.

source: This variant was later improved by Bentley and McIlroy (1993) and is now the default sorting algorithm in many standard libraries when duplicates are common.
pt: Esta variante foi posteriormente melhorada por Bentley e McIlroy (1993) e agora é o algoritmo de ordenação padrão em muitas bibliotecas quando duplicatas são comuns.

source: Try it yourself
pt: Experimente você mesmo

source: Understand the history, complexity, and best use cases for each sorting algorithm.
pt: Entenda a história, complexidade e melhores casos de uso para cada algoritmo de ordenação.

source: Unstable
pt: Instável

source: Used as the default sort in C, Java, and many other languages
pt: Usado como ordenação padrão em C, Java e muitas outras linguagens

source: Used in hybrid algorithms like Timsort
pt: Usado em algoritmos híbridos como Timsort

source: Uses binary heap data structure.
pt: Usa estrutura de dados heap binário.

source: Very small datasets
pt: Conjuntos de dados muito pequenos

source: When code size matters
pt: Quando tamanho do código importa

source: When stability not needed
pt: Quando estabilidade não é necessária

source: When to use
pt: Quando usar

source: Where simplicity matters more than speed
pt: Onde simplicidade importa mais que velocidade

source: While it has guaranteed O(n log n) complexity and uses O(1) extra space, it typically performs slower than Quick Sort in practice due to poor cache locality.
pt: Embora tenha complexidade O(n log n) garantida e use espaço extra O(1), tipicamente executa mais devagar que Quick Sort na prática devido à baixa localidade de cache.

source: While not efficient for large datasets, it has the advantage of making the minimum number of swaps (O(n)), which can be useful when memory writes are expensive.
pt: Embora não seja eficiente para grandes conjuntos de dados, tem a vantagem de fazer o número mínimo de trocas (O(n)), o que pode ser útil quando escritas em memória são caras.

source: With early termination optimization
pt: Com otimização de terminação antecipada

source: Worst
pt: Pior

source: Worst Case
pt: Pior Caso

source: Yes
pt: Sim

source: is an in-place comparison sorting algorithm. It divides the input into a sorted and unsorted region.
pt: é um algoritmo de ordenação por comparação in-place. Divide a entrada em uma região ordenada e uma não ordenada.

source: is one of the simplest sorting algorithms. It was developed based on how people typically sort playing cards in their hands.
pt: é um dos algoritmos de ordenação mais simples. Foi desenvolvido baseado em como pessoas tipicamente ordenam cartas de baralho em suas mãos.

source: is perhaps the most well-known sorting algorithm, often taught as an introduction to sorting concepts.
pt: é talvez o algoritmo de ordenação mais conhecido, frequentemente ensinado como introdução a conceitos de ordenação.

source: was developed by Tony Hoare in 1959 and published in 1961. It's often the fastest sorting algorithm in practice.
pt: foi desenvolvido por Tony Hoare em 1959 e publicado em 1961. É frequentemente o algoritmo de ordenação mais rápido na prática.

source: was invented by Donald Shell in 1959. It was one of the first algorithms to break the O(n²) barrier.
pt: foi inventado por Donald Shell em 1959. Foi um dos primeiros algoritmos a quebrar a barreira O(n²).

source: was invented by J. W. J. Williams in 1964. It uses a binary heap data structure to efficiently find and remove the maximum element.
pt: foi inventado por J. W. J. Williams em 1964. Usa uma estrutura de dados heap binário para encontrar e remover eficientemente o elemento máximo.

source: was invented by John von Neumann in 1945. It's one of the most respected sorting algorithms due to its guaranteed O(n log n) performance.
pt: foi inventado por John von Neumann em 1945. É um dos algoritmos de ordenação mais respeitados devido ao seu desempenho garantido O(n log n).

source: Best, average, and worst case analysis
pt: Análise de melhor, médio e pior caso

source: Discover the ideal scenarios for each algorithm based on data characteristics.
pt: Descubra os cenários ideais para cada algoritmo baseado nas características dos dados.

source: Dive Deeper with Learn
pt: Aprofunde-se com o Aprender

source: Go beyond visualization. Our Learn section provides comprehensive documentation for each algorithm, including historical context, step-by-step breakdowns, and practical use cases.
pt: Vá além da visualização. Nossa seção Aprender fornece documentação completa para cada algoritmo, incluindo contexto histórico, explicações passo a passo e casos de uso práticos.

source: How it Works
pt: Como Funciona

source: Learn who invented each algorithm and when, understanding the evolution of sorting techniques.
pt: Saiba quem inventou cada algoritmo e quando, entendendo a evolução das técnicas de ordenação.

source: Origins and inventors of each algorithm
pt: Origens e inventores de cada algoritmo

source: Rich History
pt: História Rica

source: Step-by-Step Guide
pt: Guia Passo a Passo

source: Step-by-step algorithm breakdown
pt: Explicação passo a passo do algoritmo

source: Understand exactly how each algorithm works with clear, numbered instructions.
pt: Entenda exatamente como cada algoritmo funciona com instruções claras e numeradas.

source: When to Use
pt: Quando Usar

source: Comparative Chart
pt: Quadro Comparativo

source: Comparative chart of sorting algorithms
pt: Quadro comparativo de algoritmos de ordenação

source: Implementation
pt: Implementação

source: A stable sorting algorithm maintains the relative order of elements with equal keys.
pt: Um algoritmo de ordenação estável mantém a ordem relativa dos elementos com chaves iguais.

source: Before diving into algorithms, it's essential to understand the key metrics used to evaluate and compare them.
pt: Antes de mergulhar nos algoritmos, é essencial entender as métricas-chave usadas para avaliá-los e compará-los.

source: Big O Notation
pt: Notação Big O

source: Big O describes the upper bound of an algorithm's growth rate, focusing on the dominant term.
pt: Big O descreve o limite superior da taxa de crescimento de um algoritmo, focando no termo dominante.

source: Complexity Growth Visualization
pt: Visualização do Crescimento da Complexidade

source: Constant
pt: Constante

source: Constant space - uses fixed memory regardless of input
pt: Espaço constante - usa memória fixa independente da entrada

source: Example:
pt: Exemplo:

source: Expected time for random input
pt: Tempo esperado para entrada aleatória

source: Input Size (n)
pt: Tamanho da Entrada (n)

source: Input: [(A,2), (B,1), (C,2), (D,1)]
pt: Entrada: [(A,2), (B,1), (C,2), (D,1)]

source: Insertion Sort and Bubble Sort approach O(n) performance on nearly sorted arrays.
pt: Insertion Sort e Bubble Sort aproximam-se de desempenho O(n) em arrays quase ordenados.

source: Large Data
pt: Dados Grandes

source: Linear - memory grows with input size
pt: Linear - memória cresce com tamanho da entrada

source: Linearithmic
pt: Linearítmico

source: Logarithmic
pt: Logarítmico

source: Logarithmic - typically from recursion stack
pt: Logarítmico - tipicamente da pilha de recursão
