Repository: hjunior29/algorithms
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: pt

source: Maximum time the algorithm can take
pt: Tempo máximo que o algoritmo pode levar

source: Name
pt: Nome

source: Nearly Sorted Data
pt: Dados Quase Ordenados

source: Notation
pt: Notação

source: Practical Tips for Choosing an Algorithm
pt: Dicas Práticas para Escolher um Algoritmo

source: Quadratic
pt: Quadrático

source: Simple algorithms like Insertion Sort often outperform complex ones due to low overhead.
pt: Algoritmos simples como Insertion Sort frequentemente superam os complexos devido ao baixo overhead.

source: Small Data (n < 50)
pt: Dados Pequenos (n < 50)

source: Space Complexity
pt: Complexidade de Espaço

source: Space complexity measures the additional memory an algorithm needs relative to the input size.
pt: Complexidade de espaço mede a memória adicional que um algoritmo precisa em relação ao tamanho da entrada.

source: Stability
pt: Estabilidade

source: Stability matters when sorting by multiple criteria or preserving previous orderings.
pt: Estabilidade importa ao ordenar por múltiplos critérios ou preservar ordenações anteriores.

source: Stable: [(B,1), (D,1), (A,2), (C,2)]
pt: Estável: [(B,1), (D,1), (A,2), (C,2)]

source: The minimum time the algorithm takes (ideal input)
pt: O tempo mínimo que o algoritmo leva (entrada ideal)

source: This chart shows how different time complexities scale as the input size (n) increases. Notice how O(n²) grows much faster than O(n log n).
pt: Este gráfico mostra como diferentes complexidades de tempo escalam conforme o tamanho da entrada (n) aumenta. Note como O(n²) cresce muito mais rápido que O(n log n).

source: Time Complexity
pt: Complexidade de Tempo

source: Time complexity describes how the runtime of an algorithm grows as the input size increases. It's expressed using Big O notation.
pt: Complexidade de tempo descreve como o tempo de execução de um algoritmo cresce conforme o tamanho da entrada aumenta. É expressa usando notação Big O.

source: Understanding the Concepts
pt: Entendendo os Conceitos

source: Unstable: [(D,1), (B,1), (C,2), (A,2)]
pt: Instável: [(D,1), (B,1), (C,2), (A,2)]

source: Use O(n log n) algorithms like Merge Sort, Heap Sort, or Quick Sort for best performance.
pt: Use algoritmos O(n log n) como Merge Sort, Heap Sort ou Quick Sort para melhor desempenho.

source: Operations needed to process 1,000 elements
pt: Operações necessárias para processar 1.000 elementos

source: Ops for n=1000
pt: Ops p/ n=1000

source: The table shows how many operations each complexity requires to process 1,000 items. Notice how O(n²) needs 1 million operations while O(n) only needs 1,000.
pt: A tabela mostra quantas operações cada complexidade requer para processar 1.000 itens. Note como O(n²) precisa de 1 milhão de operações enquanto O(n) precisa apenas de 1.000.
